src/InformationRegisters/Scan_ПараметрыВидимостиОбъектов/Scan_ПараметрыВидимостиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ПараметрыВидимостиОбъектов</name>
  <comment>Регистр для хранения настроек видимости полей &quot;Соглашения о поставке&quot; и &quot;Специальные условия&quot;</comment>
  <resources>
    <name>Видимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Доступность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>РучноеИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>ОбъектНастройки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыЗаявокНаДействие</types>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
      <types>CatalogRef.Scan_СтатусыКалькуляций</types>
      <types>CatalogRef.Scan_СтатусыЗаявокНаОтгрузку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.Scan_ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/Scan_ТипыСоглашенийОПоставке/Scan_ТипыСоглашенийОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Scan_ТипыСоглашенийОПоставке</name>
  <enumValues>
    <name>ЗаявкаНаСОП</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаСОПSRU</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Scan_СоглашенияОПоставке/Scan_СоглашенияОПоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_СоглашенияОПоставке</name>
  <basedOn>Catalog.Scan_СоглашенияОПоставке</basedOn>
  <basedOn>Catalog.Scan_СпециальныеУсловия</basedOn>
  <attributes>
    <name>DDS</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FFU</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>IDПродуктаКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SORDER</name>
    <type>
      <types>CatalogRef.Scan_ОпцииПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Дилер</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Scan_ДоговорыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихДней</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоммерческоеПредложениеSPORT</name>
    <type>
      <types>CatalogRef.Scan_КоммерческиеПредложения</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КонечныйКлиентКомпания</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Scan_Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Кузовостроитель</name>
    <type>
      <types>CatalogRef.Scan_Компании</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПоПродукту</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>CatalogRef.Scan_МоделиПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКоммерческогоПредложенияSPORTДляЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСОП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Scan_Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродавецДилера</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РегиональныйМенеджер</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныеУсловия</name>
    <type>
      <types>CatalogRef.Scan_СпециальныеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>СтандартнаяСпецификация</name>
    <type>
      <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.Scan_ТипыСтатусовЗаявки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоглашенияОПоставке</name>
    <type>
      <types>EnumRef.Scan_ТипыСоглашенийОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>УникальностьСпецификации</name>
    <type>
      <types>EnumRef.Scan_ТипыСпецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветКабины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФальшрадиаторнойРешетки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСоглашенияОПоставке</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.Scan_СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Scan_КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяРазмещениеЗаказа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаявкиНаСОПSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДилераSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийSRUSOWA</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаБУПродукты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийИзУТ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрепленныйМенеджерОКП</name>
    <type>
      <types>CatalogRef.Scan_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютнаяОговорка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаАвтобусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаРезерв</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсходнаяЗаявка</name>
    <type>
      <types>CatalogRef.Scan_СоглашенияОПоставке</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УсловияОплаты</name>
    <attributes>
      <name>ПроцентОплаты</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокОплатыАванса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДатаОплаты</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РасчетДатыОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыРасчетаДатыОплаты</types>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СписокПродуктов</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
        <types>CatalogRef.Scan_ДрафтыПродуктов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентДрайв</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СпециальныеУсловия</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
      </type>
    </attributes>
    <attributes>
      <name>DDЗапрошенная</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DDS</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладОтгрузки</name>
      <type>
        <types>CatalogRef.Scan_Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Драйв</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоВалютнойОговорке</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПерерасчета</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГрафикПлатежей</name>
    <attributes>
      <name>ВидОплаты</name>
      <type>
        <types>EnumRef.Scan_ВидыОплат</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПлатежа</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Scan_Изделия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ПараметрыВидимостиОбъектов/Forms/ФормаПараметровКопированияНабора/Module.bsl
//Rarus bonmak 28.07.2022 18726 добавил области

#Область ОбработчикиСобытийФормы

//rarus vikhle 23.06.2020 mt 15888 +++
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаНачальная = ПолучитьИзВременногоХранилища(Параметры.АдресВременногоХранилища);
	ОбъектНастройки = Параметры.ОбъектНастройки;
	
	Если ОбъектНастройки = "Scan_СоглашенияОПоставке" Тогда
		//rarus vikhle 12.08.2021 mt 17834 +++
		Если Параметры.ТипЗаявки = Перечисления.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОПSRU Тогда
			ТаблицаИменЭлементов = Справочники.Scan_СоглашенияОПоставке.ПолучитьСписокЭлементовДляНастройки(Параметры.ТипЗаявки);
			
			ТипСоглашенияОПоставке = Параметры.ТипЗаявки;
			Элементы.ТипСоглашенияОПоставке.СписокВыбора.Добавить(Перечисления.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОПSRU);
		Иначе
			ТаблицаИменЭлементов = Справочники.Scan_СоглашенияОПоставке.ПолучитьСписокЭлементовДляНастройки();	
			
			Элементы.ТипСоглашенияОПоставке.СписокВыбора.Добавить(Перечисления.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСклад);
			Элементы.ТипСоглашенияОПоставке.СписокВыбора.Добавить(Перечисления.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОП);
		КонецЕсли;
		//rarus vikhle 12.08.2021 mt 17834 ---
		Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ПустаяСсылка();
		Элементы.ХозОперация.ТолькоПросмотр = Истина;
	ИначеЕсли ОбъектНастройки = "Scan_СпециальныеУсловия" Тогда 
		ТаблицаИменЭлементов = Справочники.Scan_СпециальныеУсловия.ПолучитьСписокЭлементовДляНастройки();
		Статус = Справочники.Scan_СтатусыСоглашенийОПоставкеИСпециальныхУсловий.ПустаяСсылка();
		Элементы.ХозОперация.ТолькоПросмотр = Истина;
		Элементы.ТипСоглашенияОПоставке.ТолькоПросмотр = Истина;	
	ИначеЕсли ОбъектНастройки = "Scan_Калькуляция" Тогда
		ТаблицаИменЭлементов = Документы.Scan_Калькуляция.ПолучитьСписокЭлементовДляНастройки();
		Статус = Справочники.Scan_СтатусыКалькуляций.ПустаяСсылка();
		Элементы.ТипСоглашенияОПоставке.ТолькоПросмотр = Истина;
	ИначеЕсли ОбъектНастройки = "Scan_ЗаявкаНаОтгрузку" Тогда
		ТаблицаИменЭлементов = Документы.Scan_ЗаявкаНаОтгрузку.ПолучитьСписокЭлементовДляНастройки();
		Статус = Справочники.Scan_СтатусыЗаявокНаОтгрузку.ПустаяСсылка();
		Элементы.ТипСоглашенияОПоставке.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//Добавление необходимых имен элементов формы, которых нет в наборе-источнике 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаИменЭлементов.ИмяЭлемента КАК ИмяЭлемента
	               |ПОМЕСТИТЬ ТаблицаИменЭлементов
	               |ИЗ
	               |	&ТаблицаИменЭлементов КАК ТаблицаИменЭлементов
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаНачальная.ИмяЭлемента КАК ИмяЭлемента
	               |ПОМЕСТИТЬ ТаблицаНачальная
	               |ИЗ
	               |	&ТаблицаНачальная КАК ТаблицаНачальная
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаИменЭлементов.ИмяЭлемента КАК ИмяЭлемента
	               |ИЗ
	               |	ТаблицаИменЭлементов КАК ТаблицаИменЭлементов
	               |ГДЕ
	               |	НЕ ТаблицаИменЭлементов.ИмяЭлемента В
	               |				(ВЫБРАТЬ
	               |					ТаблицаНачальная.ИмяЭлемента
	               |				ИЗ
	               |					ТаблицаНачальная)";
	Запрос.УстановитьПараметр("ТаблицаНачальная",ТаблицаНачальная);
	Запрос.УстановитьПараметр("ТаблицаИменЭлементов",ТаблицаИменЭлементов);
	ТаблицаНовыхЭлементов = Запрос.Выполнить().Выгрузить();
	Для Каждого СтрокаТаблицы Из ТаблицаНовыхЭлементов Цикл
		НоваяСтрока = ТаблицаНачальная.Добавить();
		НоваяСтрока.ИмяЭлемента = СтрокаТаблицы.ИмяЭлемента;
		НоваяСтрока.Видимость 	= Ложь;
		НоваяСтрока.Доступность = Ложь;
	КонецЦикла;
		
	ТаблицаЭлементов.Загрузить(ТаблицаНачальная);	

КонецПроцедуры

#КонецОбласти

#Область СлужебныеФункцииИПроцедуры

&НаКлиенте
Процедура СоздатьНабор(Команда)
	
	Если ЗначениеЗаполнено(Статус) И ЗначениеЗаполнено(РольИсполнителя)
		И (ЗначениеЗаполнено(ТипСоглашенияОПоставке) ИЛИ ОбъектНастройки <> "Scan_СоглашенияОПоставке") Тогда
			Если СуществуютЗаписи() Тогда
				Оповещение = Новый ОписаниеОповещения("ПослеПредупреждения",ЭтотОбъект);
				ПоказатьВопрос(Оповещение,"Для указанных параметров существуют записи, они будут заменены, продолжить?",
							РежимДиалогаВопрос.ДаНет);	
			Иначе
				СоздатьНаборНаСервере();	
				ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.Scan_ПараметрыВидимостиОбъектов"));	
			КонецЕсли;	
	Иначе
		Сообщить("Не заполнены необходимые поля");		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНаборНаСервере()
		
	НаборЗаписей = РегистрыСведений.Scan_ПараметрыВидимостиОбъектов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Статус.Установить(Статус);
	НаборЗаписей.Отбор.РольИсполнителя.Установить(РольИсполнителя);
	НаборЗаписей.Отбор.ТипСоглашенияОПоставке.Установить(ТипСоглашенияОПоставке);
	НаборЗаписей.Отбор.ОбъектНастройки.Установить(ОбъектНастройки);
	НаборЗаписей.Отбор.ХозОперация.Установить(ХозОперация);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Для Каждого Элемент Из ТаблицаЭлементов Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ОбъектНастройки        = ОбъектНастройки;
		НоваяЗапись.РольИсполнителя        = РольИсполнителя;
		НоваяЗапись.Статус                 = Статус;
		НоваяЗапись.ТипСоглашенияОПоставке = ТипСоглашенияОПоставке;
		НоваяЗапись.ХозОперация            = ХозОперация;
		НоваяЗапись.ИмяЭлемента            = Элемент.ИмяЭлемента;
		НоваяЗапись.Видимость              = Элемент.Видимость;
		НоваяЗапись.Доступность            = Элемент.Доступность;
		//rarus agar 15.07.2020  16055 ++
		НоваяЗапись.РучноеИзменение        = Истина;
		//rarus agar 15.07.2020  16055 --
	КонецЦикла;
	
	Попытка
		НаборЗаписей.Записать();
		Сообщить("Набор успешно создан");
	Исключение
		Сообщить("Не удалось создать набор записей");
	КонецПопытки;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПослеПредупреждения(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
    	СоздатьНаборНаСервере();
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.Scan_ПараметрыВидимостиОбъектов"));
	КонецЕсли;		
	
КонецПроцедуры

&НаСервере
Функция СуществуютЗаписи()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Scan_ПараметрыВидимостиОбъектов.ОбъектНастройки КАК ОбъектНастройки,
	               |	Scan_ПараметрыВидимостиОбъектов.РольИсполнителя КАК РольИсполнителя,
	               |	Scan_ПараметрыВидимостиОбъектов.ТипСоглашенияОПоставке КАК ТипСоглашенияОПоставке,
	               |	Scan_ПараметрыВидимостиОбъектов.Статус КАК Статус,
	               |	Scan_ПараметрыВидимостиОбъектов.ИмяЭлемента КАК ИмяЭлемента,
	               |	Scan_ПараметрыВидимостиОбъектов.ХозОперация КАК ХозОперация,
	               |	Scan_ПараметрыВидимостиОбъектов.Видимость КАК Видимость,
	               |	Scan_ПараметрыВидимостиОбъектов.Доступность КАК Доступность
	               |ИЗ
	               |	РегистрСведений.Scan_ПараметрыВидимостиОбъектов КАК Scan_ПараметрыВидимостиОбъектов
	               |ГДЕ
	               |	Scan_ПараметрыВидимостиОбъектов.ОбъектНастройки = &ОбъектНастройки
	               |	И Scan_ПараметрыВидимостиОбъектов.РольИсполнителя = &РольИсполнителя
	               |	И Scan_ПараметрыВидимостиОбъектов.ТипСоглашенияОПоставке = &ТипСоглашенияОПоставке
	               |	И Scan_ПараметрыВидимостиОбъектов.Статус = &Статус
	               |	И Scan_ПараметрыВидимостиОбъектов.ХозОперация = &ХозОперация";
	Запрос.УстановитьПараметр("ОбъектНастройки",ОбъектНастройки);
	Запрос.УстановитьПараметр("РольИсполнителя",РольИсполнителя);
	Запрос.УстановитьПараметр("ТипСоглашенияОПоставке",ТипСоглашенияОПоставке);
	Запрос.УстановитьПараметр("Статус",Статус);
	Запрос.УстановитьПараметр("ХозОперация",ХозОперация);
	РезультатЗапроса = Запрос.Выполнить();	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//пустой массив для обнуления отборов в параметре выбор
	МассивПараметров = Новый Массив();
	ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
	Элемент.ПараметрыВыбора = ПараметрыВыбора;
	
	Если ОбъектНастройки = "Scan_СоглашенияОПоставке" Тогда   
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ИспользуетсяВСоглашенииОПоставке", Истина));
		Если ТипСоглашенияОПоставке = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСклад") Тогда
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ИспользуетсяВТипеЗаявкаНаСклад", Истина));
		ИначеЕсли ТипСоглашенияОПоставке = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОП") Тогда
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ИспользуетсяВТипеЗаявкаНаСОП", Истина));
		//rarus vikhle 05.08.2021 mt 17834 +++	
		ИначеЕсли ТипСоглашенияОПоставке = ПредопределенноеЗначение("Перечисление.Scan_ТипыСоглашенийОПоставке.ЗаявкаНаСОПSRU") Тогда
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ИспользуетсяВТипеЗаявкаНаСОПSRU", Истина));	
		КонецЕсли;	
		//rarus vikhle 05.08.2021 mt 17834 ---
		ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		Элемент.ПараметрыВыбора = ПараметрыВыбора;	
	ИначеЕсли ОбъектНастройки = "Scan_СпециальныеУсловия"	Тогда
		МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.ИспользуетсяВСпециальныхУсловиях", Истина));
		ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		Элемент.ПараметрыВыбора = ПараметрыВыбора;		
	КонецЕсли;
	
КонецПроцедуры
//rarus vikhle 23.06.2020 mt 15888 ---

#КонецОбласти
